Оборудование/src/Documents/ВозвратСЗаправки/ВозвратСЗаправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратСЗаправки</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <attributes>
    <name>Куда</name>
    <type>
      <types>CatalogRef.Субъекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Оборудование/src/Documents/ВозвратСЗаправки/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОборудованиеЦенаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Оборудование.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
	Элементы.ОборудованиеСумма.ТекстПодвала = Объект.Оборудование.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ОборудованиеСумма.ТекстПодвала = Объект.Оборудование.Итог("Сумма");
КонецПроцедуры
